{
  "users": [
    {
      "id": "001",
      "login": "egor_cherepanov",
      "password": "qwerty123",
      "registered_at": "2025-03-11",
      "role_id": 0
    }
  ],
  "roles": [
    {
      "id": 0,
      "name": "Администратор"
    },
    {
      "id": 1,
      "name": "Модератор"
    },
    {
      "id": 2,
      "name": "Читатель"
    },
    {
      "id": 3,
      "name": "Гость"
    }
  ],
  "posts": [
    {
      "id": "001",
      "title": "Задача организации, в особенности же начало повседневной работы по формированию позиции",
      "image_url": "https://fastly.picsum.photos/id/455/280/150.jpg?hmac=mpbz92MtFpOE5y7KsWUfGq2ARtjanq2JieEJI2y0344",
      "content": "Задача организации, в особенности же начало повседневной работы по формированию позиции играет важную роль в формировании систем массового участия. Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности представляет собой интересный эксперимент проверки модели развития. Таким образом постоянное информационно-пропагандистское обеспечение нашей деятельности влечет за собой процесс внедрения и модернизации соответствующий условий активизации.",
      "published_at": "2025-03-11"
    },
    {
      "id": "002",
      "title": "Дальнейшее развитие различных форм деятельности ",
      "image_url": "https://fastly.picsum.photos/id/1079/280/150.jpg?hmac=vruVm2nU_tv-mJmcJuw6FlFWCAe9EQEGxueiN_M8fc4",
      "content": "Повседневная практика показывает, что дальнейшее развитие различных форм деятельности позволяет выполнять важные задания по разработке направлений прогрессивного развития. Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также новая модель организационной деятельности обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития.",
      "published_at": "2025-02-01"
    },
    {
      "id": "003",
      "title": "начало повседневной работы",
      "image_url": "https://fastly.picsum.photos/id/325/280/150.jpg?hmac=PCrPyHfW-0pg84LGU43xutZth8jETZmlj86WRgCOjXE",
      "content": "Товарищи! начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании модели развития. Идейные соображения высшего порядка, а также новая модель организационной деятельности играет важную роль в формировании соответствующий условий активизации. Таким образом консультация с широким активом играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям.",
      "published_at": "2023-03-11"
    },
    {
      "id": "004",
      "title": "С другой стороны начало повседневной",
      "image_url": "https://fastly.picsum.photos/id/392/280/150.jpg?hmac=tRjBJwWK3Ggx9DSL1ePS8j7eAAaK6peoCabr9QXlpMA",
      "content": "С другой стороны начало повседневной работы по формированию позиции требуют от нас анализа систем массового участия. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции позволяет оценить значение существенных финансовых и административных условий. Не следует, однако забывать, что сложившаяся структура организации играет важную роль в формировании дальнейших направлений развития. Значимость этих проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения модели развития.",
      "published_at": "2025-01-16"
    },
    {
      "id": "005",
      "title": "Не следует, однако забывать",
      "image_url": "https://fastly.picsum.photos/id/183/280/150.jpg?hmac=1s9AxIRp3Y6cinqdzjhvbxlkE4lSI0U0bn7IZXmfwcY",
      "content": "Не следует, однако забывать, что постоянный количественный рост и сфера нашей активности в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий способствует подготовки и реализации модели развития. Значимость этих проблем настолько очевидна, что сложившаяся структура организации обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития. Таким образом укрепление и развитие структуры позволяет выполнять важные задания по разработке модели развития. Повседневная практика показывает, что сложившаяся структура организации представляет собой интересный эксперимент проверки новых предложений. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке дальнейших направлений развития.",
      "published_at": "2020-09-21"
    },
    {
      "id": "006",
      "title": "Равным образом дальнейшее развитие",
      "image_url": "https://fastly.picsum.photos/id/845/280/150.jpg?hmac=u2rl1qRlq6pT74T7MX7O6kklTAcf10ZTrfrG9Ak-Lwc",
      "content": "Равным образом дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! сложившаяся структура организации требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение дальнейших направлений развития. Товарищи! рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений развития.",
      "published_at": "2024-09-11"
    }
  ],
  "comments": [
    {
      "id": "",
      "author_id": "",
      "post_id": "",
      "content": ""
    }
  ]
}
