{
  "users": [
    {
      "id": "001",
      "login": "egor",
      "password": "qwerty123",
      "registered_at": "2025-03-11",
      "role_id": 0
    },
    {
      "id": "002",
      "login": "polina",
      "password": "12345678",
      "registered_at": "2024-03-14",
      "role_id": 0
    },
    {
      "id": "003",
      "login": "kolya",
      "password": "12345678",
      "registered_at": "2024-03-14",
      "role_id": 1
    },
    {
      "id": "004",
      "login": "dima",
      "password": "12345678",
      "registered_at": "2024-03-14",
      "role_id": 2
    }
  ],
  "roles": [
    {
      "id": "0",
      "name": "Администратор"
    },
    {
      "id": "1",
      "name": "Модератор"
    },
    {
      "id": "2",
      "name": "Читатель"
    },
    {
      "id": "3",
      "name": "Гость"
    }
  ],
  "posts": [
    {
      "id": "002",
      "title": "Дальнейшее развитие различных форм деятельности ",
      "image_url": "https://fastly.picsum.photos/id/1079/280/150.jpg?hmac=vruVm2nU_tv-mJmcJuw6FlFWCAe9EQEGxueiN_M8fc4",
      "content": "Повседневная практика показывает, что дальнейшее развитие различных форм деятельности позволяет выполнять важные задания по разработке направлений прогрессивного развития. Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности играет важную роль в формировании позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также новая модель организационной деятельности обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития.",
      "published_at": "2025-02-01"
    },
    {
      "id": "003",
      "title": "начало повседневной работы",
      "image_url": "https://fastly.picsum.photos/id/325/280/150.jpg?hmac=PCrPyHfW-0pg84LGU43xutZth8jETZmlj86WRgCOjXE",
      "content": "Товарищи! начало повседневной работы по формированию позиции обеспечивает широкому кругу (специалистов) участие в формировании модели развития. Идейные соображения высшего порядка, а также новая модель организационной деятельности играет важную роль в формировании соответствующий условий активизации. Таким образом консультация с широким активом играет важную роль в формировании системы обучения кадров, соответствует насущным потребностям.",
      "published_at": "2023-03-11"
    },
    {
      "id": "004",
      "title": "С другой стороны начало повседневной",
      "image_url": "https://fastly.picsum.photos/id/392/280/150.jpg?hmac=tRjBJwWK3Ggx9DSL1ePS8j7eAAaK6peoCabr9QXlpMA",
      "content": "С другой стороны начало повседневной работы по формированию позиции требуют от нас анализа систем массового участия. Товарищи! постоянное информационно-пропагандистское обеспечение нашей деятельности способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач. Значимость этих проблем настолько очевидна, что начало повседневной работы по формированию позиции позволяет оценить значение существенных финансовых и административных условий. Не следует, однако забывать, что сложившаяся структура организации играет важную роль в формировании дальнейших направлений развития. Значимость этих проблем настолько очевидна, что постоянное информационно-пропагандистское обеспечение нашей деятельности требуют определения и уточнения модели развития.",
      "published_at": "2025-01-16"
    },
    {
      "id": "005",
      "title": "Не следует, однако забывать",
      "image_url": "https://fastly.picsum.photos/id/183/280/150.jpg?hmac=1s9AxIRp3Y6cinqdzjhvbxlkE4lSI0U0bn7IZXmfwcY",
      "content": "Не следует, однако забывать, что постоянный количественный рост и сфера нашей активности в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также реализация намеченных плановых заданий способствует подготовки и реализации модели развития. Значимость этих проблем настолько очевидна, что сложившаяся структура организации обеспечивает широкому кругу (специалистов) участие в формировании направлений прогрессивного развития. Таким образом укрепление и развитие структуры позволяет выполнять важные задания по разработке модели развития. Повседневная практика показывает, что сложившаяся структура организации представляет собой интересный эксперимент проверки новых предложений. Разнообразный и богатый опыт сложившаяся структура организации позволяет выполнять важные задания по разработке дальнейших направлений развития.",
      "published_at": "2020-09-21"
    },
    {
      "id": "006",
      "title": "Равным образом дальнейшее развитие",
      "image_url": "https://fastly.picsum.photos/id/845/280/150.jpg?hmac=u2rl1qRlq6pT74T7MX7O6kklTAcf10ZTrfrG9Ak-Lwc",
      "content": "Равным образом дальнейшее развитие различных форм деятельности требуют определения и уточнения направлений прогрессивного развития. Товарищи! сложившаяся структура организации требуют от нас анализа позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет оценить значение дальнейших направлений развития. Товарищи! рамки и место обучения кадров обеспечивает широкому кругу (специалистов) участие в формировании соответствующий условий активизации. Не следует, однако забывать, что дальнейшее развитие различных форм деятельности влечет за собой процесс внедрения и модернизации дальнейших направлений развития.",
      "published_at": "2024-09-11"
    },
    {
      "id": "eb0d",
      "image_url": "https://fastly.picsum.photos/id/350/280/150.jpg?hmac=N6YMYhj0IyX761ZN1ig4RuTtsX7UKznnq5WDlbO8APk",
      "title": "Москва",
      "content": "О город мой любимый город",
      "published_at": "2058-01-30 21:34"
    },
    {
      "id": "1171",
      "image_url": "https://fastly.picsum.photos/id/930/280/150.jpg?hmac=DFLkjOnB8DaMArsJHtdbIGVS83wQnedpTrwMWEjJwDA",
      "title": "Равным образом новая модель организационной деятельности позволяет выполнять важные задания ",
      "content": "Равным образом новая модель организационной деятельности позволяет выполнять важные задания по разработке соответствующий условий активизации. Повседневная практика показывает, что консультация с широким активом требуют определения и уточнения системы обучения кадров, соответствует насущным потребностям.\n\nНе следует, однако забывать, что новая модель организационной деятельности играет важную роль в формировании систем массового участия. Задача организации, в особенности же рамки и место обучения кадров в значительной степени обуславливает создание системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также рамки и место обучения кадров позволяет выполнять важные задания по разработке существенных финансовых и административных условий. Повседневная практика показывает, что рамки и место обучения кадров играет важную роль в формировании направлений прогрессивного развития.\n\nТоварищи! начало повседневной работы по формированию позиции позволяет выполнять важные задания по разработке системы обучения кадров, соответствует насущным потребностям. С другой стороны сложившаяся структура организации играет важную роль в формировании новых предложений. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности в значительной степени обуславливает создание модели развития. Разнообразный и богатый опыт постоянное информационно-пропагандистское обеспечение нашей деятельности позволяет выполнять важные задания по разработке форм развития. Не следует, однако забывать, что новая модель организационной деятельности позволяет оценить значение модели развития.\n\nТаким образом постоянное информационно-пропагандистское обеспечение нашей деятельности представляет собой интересный эксперимент проверки новых предложений. Равным образом консультация с широким активом требуют от нас анализа форм развития. Равным образом сложившаяся структура организации способствует подготовки и реализации позиций, занимаемых участниками в отношении поставленных задач.",
      "published_at": "2058-07-30 06:07"
    },
    {
      "id": "0e61",
      "image_url": "https://fastly.picsum.photos/id/411/280/150.jpg?hmac=tG3J9YRoRpVdNYkB1CZagsp9qM5-hzanUAWQfU5c3J8",
      "title": "Текст-рыба",
      "content": "С другой стороны консультация с широким активом позволяет выполнять важные задания по разработке систем массового участия. Таким образом реализация намеченных плановых заданий требуют от нас анализа новых предложений. Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности обеспечивает широкому кругу (специалистов) участие в формировании системы обучения кадров, соответствует насущным потребностям.",
      "published_at": "2064-11-13 03:16"
    },
    {
      "id": "1033",
      "image_url": "https://fastly.picsum.photos/id/344/280/150.jpg?hmac=i-Vo93W1VfEbZxA098I7fbnJS00-7pnGQQTVwkzi7KU",
      "title": "Город в тумане…",
      "content": "Город в тумане… Серая пелена окутывала его, словно тайной завесой. Дома теряли свои очертания, превращаясь в призрачные силуэты, а фонари пробивались сквозь мглу тусклыми, дрожащими огоньками. Запах сырости и холода проникал в самую душу, напоминая о приближающейся зиме.\n\nУлицы, обычно оживленные и шумные, сегодня казались пустынными и безмолвными. Лишь изредка можно было услышать приглушенный гудок автомобиля или тихий шепот ветра, проносящегося между домами. Все вокруг замерло в ожидании, словно город затаил дыхание.\n\nВ такую погоду хорошо сидеть дома, у камина, с чашкой горячего чая и интересной книгой. Но кто-то должен быть на улице, кто-то должен выполнять свою работу, несмотря на туман и холод. Люди спешат по своим делам, закутавшись в теплые шарфы и пальто, стараясь не замечать серость и уныние вокруг.\n\nТуман – это время для размышлений, для погружения в себя. Он словно стирает границы между реальностью и фантазией, позволяя увидеть мир в ином свете. Город в тумане – это город тайн и загадок, город, где возможно все. И кто знает, какие истории скрываются за этой серой пеленой, какие приключения ждут тех, кто осмелится отправиться в путь по его туманным улицам.",
      "published_at": "2046-09-09 15:27"
    },
    {
      "id": "5293",
      "image_url": "https://fastly.picsum.photos/id/350/280/150.jpg?hmac=N6YMYhj0IyX761ZN1ig4RuTtsX7UKznnq5WDlbO8APk",
      "title": "Берег у моря… ",
      "content": "Берег у моря… Хрупкая линия соприкосновения двух стихий. Здесь властвует переменчивость, игра света и тени, неумолчный шепот волн, вечно стремящихся к песчаному покою. Запах соли и йода пронизывает воздух, щекочет ноздри и будоражит память, напоминая о далеких путешествиях и безграничных горизонтах.\n\nМелкий песок, прогретый солнцем, нежно ласкает ступни. Он податлив и сыпуч, легко принимает форму ноги, а затем ускользает, оставляя лишь мимолетный след. Ракушки, выброшенные волной, словно драгоценные камни, рассыпаны по берегу. Каждая из них – уникальный артефакт, свидетель бурных морских глубин и тайн, скрытых под толщей воды.\n\nЧайки, гордые и независимые, парят в небе, высматривая добычу. Их крики, то пронзительные, то мелодичные, сливаются с шумом прибоя, создавая неповторимую симфонию моря. Волны, накатывающие на берег, то лениво и сонно, то яростно и стремительно, оставляют после себя пенный след, который быстро растворяется в песке.\n\nНа горизонте, словно мираж, виднеются силуэты кораблей. Они кажутся маленькими и беззащитными перед лицом могучей стихии. Но они продолжают свой путь, уверенно рассекая волны, направляясь к далеким берегам, к новым открытиям и приключениям.\n\nИ сидя на берегу, вдыхая соленый воздух и слушая шум моря, ощущаешь себя частью этого бесконечного мира, маленькой песчинкой в бескрайней вселенной. И в этом единении с природой находишь покой и умиротворение, забывая о суете и проблемах повседневной жизни.",
      "published_at": "2046-10-23 18:47"
    },
    {
      "id": "7f52",
      "image_url": "https://fastly.picsum.photos/id/576/280/150.jpg?hmac=KUhJS2RUPSGMYe2xbQYvEzh7s5_iSiZX4Icmqri9Frc",
      "title": "Дороги",
      "content": "Веками дороги были артериями цивилизации, связующими города и веси, умы и сердца. Они – не просто полоски асфальта или тропы, протоптанные сквозь дикую местность, а живые свидетели истории, отпечаток стремлений и мечтаний человечества.\n\nИзначально дороги – это тропы, проложенные ногами охотников и собирателей, петляющие сквозь леса и степи в поисках пищи и убежища. С развитием земледелия и торговли возникла потребность в более надежных и широких путях. Римляне, известные своими инженерными достижениями, проложили мощеные дороги, соединяющие отдаленные уголки империи, обеспечивая быструю связь и перемещение войск. Эти дороги, некоторые из которых сохранились до наших дней, стали символом мощи и порядка.\n\nВ Средние века дороги часто приходили в запустение, страдали от разбойников и войн. Однако с развитием городов и торговли в эпоху Возрождения вновь возрос интерес к строительству и поддержанию дорог. Появились почтовые тракты, связывающие города и позволяющие быстро доставлять корреспонденцию.\n\nВ эпоху индустриализации дороги приобрели еще большее значение. С появлением автомобилей возникла потребность в новых, более гладких и быстрых дорогах. Началось строительство шоссе и автомагистралей, которые радикально изменили способ передвижения и торговли.\n\nСегодня дороги – это сложные инженерные сооружения, оснащенные современной инфраструктурой, обеспечивающие комфортное и безопасное передвижение миллионов людей и тонн грузов каждый день. Они продолжают играть ключевую роль в развитии экономики, культуры и общества. Дороги – это не только пути сообщения, но и символы прогресса и связи между людьми.",
      "published_at": "2055-07-26 21:57"
    },
    {
      "id": "8651",
      "image_url": "https://fastly.picsum.photos/id/302/280/150.jpg?hmac=H7g10u4Y0HYDGSP3G8piWAzXwtSHxu4t3ffwMkELs-8",
      "title": "Одинокий буёк",
      "content": "Неподвижно застывший на зыбкой глади моря, он был одинок. Одинокий буёк, словно забытый всеми страж, качался на волнах, безмолвно наблюдая за сменой дня и ночи. Его красная окраска, некогда яркая, теперь выцвела под палящим солнцем и солеными брызгами. Он видел корабли, большие и маленькие, проплывающие мимо, но ни один не останавливался, не обращал внимания на его одиночество.\n\nБуёк помнил времена, когда его окружали другие буйки, целая семья, обозначающая фарватер для судов. Но штормы, течение и время забрали их одного за другим. Он остался один, словно последний свидетель ушедшей эпохи. Иногда, в тихие ночи, ему казалось, что он слышит шепот своих собратьев, доносящийся из глубин.\n\nДни тянулись медленно и однообразно. Солнце всходило и заходило, волны накатывали и откатывали. Буёк привык к одиночеству, но тоска по прошлому не покидала его. Он мечтал о том, чтобы его снова окружили другие буйки, чтобы он снова почувствовал себя частью чего-то большего.\n\nНо, несмотря на одиночество, буёк продолжал выполнять свою работу. Он предупреждал суда об опасности, указывал путь в безопасные воды. Он был маяком надежды в бескрайнем море, символом стойкости и преданности своему долгу. И, возможно, именно в этом заключался его истинный смысл – быть одиноким, но необходимым.",
      "published_at": "2034-05-28 06:52"
    },
    {
      "id": "69cb",
      "image_url": "https://fastly.picsum.photos/id/501/280/150.jpg?hmac=baW21tkMiXXGN7ZOmQ3DAZJdw3VepW15uo0a5yXcH-w",
      "title": "Вечеринка на леднике",
      "content": "Представьте себе: искрящийся лед, уходящий вдаль, словно застывшее море. Вокруг – величественные горы, укутанные снежной шапкой. И посреди этой ледяной пустыни – пульсирующая музыка, яркие огни и смех, согревающий даже самый холодный воздух. Это не сон, это – вечеринка на леднике!\n\nЗвучит безумно, правда? Но именно в этом и вся прелесть. Это не просто вечеринка, это приключение, которое запомнится на всю жизнь. Забудьте о душных клубах и банальных посиделках в барах. Здесь, на леднике, вы почувствуете себя первооткрывателем, покорителем стихии, частью чего-то невероятного.",
      "published_at": "2049-11-03 22:48"
    },
    {
      "id": "bfd2",
      "image_url": "https://fastly.picsum.photos/id/533/280/150.jpg?hmac=u9aodIxsN08cVD2qFrIKLsoiWVUi31tybguC1URVmEE",
      "title": "Столовые принадлежности ",
      "content": "Столовые принадлежности — неотъемлемые атрибуты нашей повседневной жизни, необходимые каждому человеку ежедневно. Они выполняют важные практические функции, обеспечивая комфортное принятие пищи, помогают поддерживать гигиену и эстетику стола. Среди основных столовых принадлежностей выделяют следующие категории",
      "published_at": "2056-03-16 08:41"
    }
  ],
  "comments": [
    {
      "id": "def8",
      "author_id": "002",
      "post_id": "002",
      "published_at": "2041-04-13 17:41",
      "content": "cssdccsddcds"
    },
    {
      "id": "1934",
      "author_id": "002",
      "post_id": "006",
      "published_at": "2052-10-10 05:13",
      "content": "что за бред то"
    }
  ],
  "sessions": [
    {
      "id": "1120",
      "hash": "0.90132599202185970099776568531524389982223510742188",
      "user": {
        "id": "001",
        "login": "egor",
        "password": "qwerty123",
        "registered_at": "2025-03-11",
        "role_id": 0
      }
    },
    {
      "id": "82b8",
      "hash": "0.06706761221154255991905301925726234912872314453125",
      "user": {
        "id": "002",
        "login": "polina",
        "password": "12345678",
        "registered_at": "2024-03-14",
        "role_id": 0
      }
    }
  ]
}